In [114]:
import pandas as pd
import numpy as np

In [115]:
dataset = [ [x, np.random.randint(low=1,high=100), np.random.randint(low=1,high=10)] for x in range(1,1000) ]
df = pd.DataFrame(dataset,columns=['id','age','order_id'])

In [116]:
# 1. SELECT * FROM data;
df

      id  age  order_id
0      1   29         6
1      2   91         2
2      3   95         6
3      4   91         1
4      5   73         3
..   ...  ...       ...
994  995   70         1
995  996   86         2
996  997   37         2
997  998   21         5
998  999   81         1

[999 rows x 3 columns]

In [117]:
# 2. SELECT * FROM data LIMIT 10;
df.head(10)

   id  age  order_id
0   1   29         6
1   2   91         2
2   3   95         6
3   4   91         1
4   5   73         3
5   6   48         1
6   7   62         1
7   8   56         3
8   9   83         3
9  10   33         8

In [118]:
# 3. SELECT id FROM data;  //id 是 data 表的特定一列
df['id']

0        1
1        2
2        3
3        4
4        5
      ...
994    995
995    996
996    997
997    998
998    999
Name: id, Length: 999, dtype: int64

In [119]:
# 4. SELECT COUNT(id) FROM data;
df['id'].count()

999

In [120]:
# 5. SELECT * FROM data WHERE id<1000 AND age>30;
df[ (df['id']<1000) & (df['age']>30) ]

      id  age  order_id
1      2   91         2
2      3   95         6
3      4   91         1
4      5   73         3
5      6   48         1
..   ...  ...       ...
993  994   81         2
994  995   70         1
995  996   86         2
996  997   37         2
998  999   81         1

[671 rows x 3 columns]

In [121]:
# 6. SELECT id,COUNT(DISTINCT order_id) FROM table1 GROUP BY id;
df.groupby('id')['order_id'].nunique()

id
1      1
2      1
3      1
4      1
5      1
      ..
995    1
996    1
997    1
998    1
999    1
Name: order_id, Length: 999, dtype: int64

In [122]:
dataset2 = [ [x, np.random.randint(low=2)] for x in range(1,1000) ]
df2 = pd.DataFrame(dataset2,columns=['id','gender'])

df2

      id  gender
0      1       0
1      2       0
2      3       1
3      4       1
4      5       1
..   ...     ...
994  995       0
995  996       1
996  997       1
997  998       1
998  999       0

[999 rows x 2 columns]

In [123]:
# 7. SELECT * FROM table1 t1 INNER JOIN table2 t2 ON t1.id = t2.id;
pd.merge(df,df2,on='id',how='inner')

      id  age  order_id  gender
0      1   29         6       0
1      2   91         2       0
2      3   95         6       1
3      4   91         1       1
4      5   73         3       1
..   ...  ...       ...     ...
994  995   70         1       0
995  996   86         2       1
996  997   37         2       1
997  998   21         5       1
998  999   81         1       0

[999 rows x 4 columns]

In [124]:
# 8. SELECT * FROM table1 UNION SELECT * FROM table2;
pd.concat([df,df2])

      id   age  order_id  gender
0      1  29.0       6.0     NaN
1      2  91.0       2.0     NaN
2      3  95.0       6.0     NaN
3      4  91.0       1.0     NaN
4      5  73.0       3.0     NaN
..   ...   ...       ...     ...
994  995   NaN       NaN     0.0
995  996   NaN       NaN     1.0
996  997   NaN       NaN     1.0
997  998   NaN       NaN     1.0
998  999   NaN       NaN     0.0

[1998 rows x 4 columns]

In [125]:
# 9. DELETE FROM table1 WHERE id=10;
df[ df.id != 10]

      id  age  order_id
0      1   29         6
1      2   91         2
2      3   95         6
3      4   91         1
4      5   73         3
..   ...  ...       ...
994  995   70         1
995  996   86         2
996  997   37         2
997  998   21         5
998  999   81         1

[998 rows x 3 columns]

In [126]:
# 10. ALTER TABLE table1 DROP COLUMN order_id;
df.drop('order_id',axis=1)

      id  age
0      1   29
1      2   91
2      3   95
3      4   91
4      5   73
..   ...  ...
994  995   70
995  996   86
996  997   37
997  998   21
998  999   81

[999 rows x 2 columns]